ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ADI/ADUCM36x/ADuCM360.h
/* MMFAR[ADDRESS] - Data address MPU faulted. */
#define MMFAR_ADDRESS_MSK              (0xFFFFFFFF << 0  )

/* Reset Value for BFAR*/
#define BFAR_RVAL                      0x0 

/* BFAR[ADDRESS] - Updated on precise data access faults */
#define BFAR_ADDRESS_MSK               (0xFFFFFFFF << 0  )

/* Reset Value for STIR*/
#define STIR_RVAL                      0x0 

/* STIR[INTID] - The value written in this field is the interrupt to be triggered. */
#define STIR_INTID_MSK                 (0x3FF << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        ADC0                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Analog to Digital Converter (pADI_ADC0)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_ADC0 Structure                    */
  __IO uint8_t   STA;                       /*!< ADC Status register                   */
  __I  uint8_t   RESERVED0[3];
  __IO uint8_t   MSKI;                      /*!< Interrupt control register            */
  __I  uint8_t   RESERVED1[3];
  __IO uint32_t  CON;                       /*!< Main control register                 */
  __IO uint16_t  OF;                        /*!< Offset calibration register           */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  INTGN;                     /*!< Gain calibration register when using internal reference */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  EXTGN;                     /*!< Gain calibration register when using external reference */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  VDDGN;                     /*!< Gain calibration register when using AVDD as the ADC reference */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  ADCCFG;                    /*!< "Control register for the VBIAS voltage generator, ground switch and external reference buffer" */
  __I  uint16_t  RESERVED6;
  __IO uint16_t  FLT;                       /*!< Filter configuration register         */
  __I  uint16_t  RESERVED7;
  __IO uint16_t  MDE;                       /*!< mode control register                 */
  __I  uint16_t  RESERVED8;
  __IO uint16_t  RCR;                       /*!< Number of ADC0 conversions before an ADC interrupt is generated. */
  __I  uint16_t  RESERVED9;
  __IO uint16_t  RCV;                       /*!< "This 16-bit, read-only MMR holds the current number of ADC0 conversion results" */
  __I  uint16_t  RESERVED10;
  __IO uint16_t  TH;                        /*!< Sets the threshold                    */
  __I  uint16_t  RESERVED11;
  __IO uint8_t   THC;                       /*!< Determines how many cumulative ADC0 conversion result readings above ADC0TH must occur */
  __I  uint8_t   RESERVED12[3];
  __IO uint8_t   THV;                       /*!< 8-bit threshold exceeded counter register */
  __I  uint8_t   RESERVED13[3];
  __IO uint32_t  ACC;                       /*!< 32-bit accumulator register           */
  __IO uint32_t  ATH;                       /*!< Holds the threshold value for the accumulator comparator */
  __IO uint8_t   PRO;                       /*!< Configuration register for Post processing of ADC0 results */
  __I  uint8_t   RESERVED14[3];
  __IO uint32_t  DAT;                       /*!< conversion result register            */
} ADI_ADC_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          ADC0STA                                    (*(volatile unsigned char      *) 0x40030000)
#define          ADC0MSKI                                   (*(volatile unsigned char      *) 0x40030004)
#define          ADC0CON                                    (*(volatile unsigned long      *) 0x40030008)
#define          ADC0OF                                     (*(volatile unsigned short int *) 0x4003000C)
#define          ADC0INTGN                                  (*(volatile unsigned short int *) 0x40030010)
#define          ADC0EXTGN                                  (*(volatile unsigned short int *) 0x40030014)
#define          ADC0VDDGN                                  (*(volatile unsigned short int *) 0x40030018)
#define          ADCCFG                                     (*(volatile unsigned short int *) 0x4003001C)
#define          ADC0FLT                                    (*(volatile unsigned short int *) 0x40030020)
#define          ADC0MDE                                    (*(volatile unsigned short int *) 0x40030024)
#define          ADC0RCR                                    (*(volatile unsigned short int *) 0x40030028)
#define          ADC0RCV                                    (*(volatile unsigned short int *) 0x4003002C)
#define          ADC0TH                                     (*(volatile unsigned short int *) 0x40030030)
#define          ADC0THC                                    (*(volatile unsigned char      *) 0x40030034)
#define          ADC0THV                                    (*(volatile unsigned char      *) 0x40030038)
#define          ADC0ACC                                    (*(volatile unsigned long      *) 0x4003003C)
#define          ADC0ATH                                    (*(volatile unsigned long      *) 0x40030040)
#define          ADC0PRO                                    (*(volatile unsigned char      *) 0x40030044)
#define          ADC0DAT                                    (*(volatile unsigned long      *) 0x40030048)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for ADC0STA*/
#define ADC0STA_RVAL                   0x0 

/* ADC0STA[CAL] - ADC Calibration status register */
#define ADC0STA_CAL_BBA                (*(volatile unsigned long *) 0x42600014)
#define ADC0STA_CAL_MSK                (0x1   << 5  )
#define ADC0STA_CAL                    (0x1   << 5  )
#define ADC0STA_CAL_DIS                (0x0   << 5  ) /* DIS                      */
#define ADC0STA_CAL_EN                 (0x1   << 5  ) /* EN                       */

/* ADC0STA[ERR] - ADC conversion error status bit. */
#define ADC0STA_ERR_BBA                (*(volatile unsigned long *) 0x42600010)
#define ADC0STA_ERR_MSK                (0x1   << 4  )
#define ADC0STA_ERR                    (0x1   << 4  )
#define ADC0STA_ERR_DIS                (0x0   << 4  ) /* DIS                      */
#define ADC0STA_ERR_EN                 (0x1   << 4  ) /* EN                       */

/* ADC0STA[ATHEX] - ADC Accumulator Comparator Threshold status bit. */
#define ADC0STA_ATHEX_BBA              (*(volatile unsigned long *) 0x4260000C)
#define ADC0STA_ATHEX_MSK              (0x1   << 3  )
#define ADC0STA_ATHEX                  (0x1   << 3  )
#define ADC0STA_ATHEX_DIS              (0x0   << 3  ) /* DIS                      */
#define ADC0STA_ATHEX_EN               (0x1   << 3  ) /* EN                       */

/* ADC0STA[THEX] - ADC comparator threshold. */
#define ADC0STA_THEX_BBA               (*(volatile unsigned long *) 0x42600008)
#define ADC0STA_THEX_MSK               (0x1   << 2  )
#define ADC0STA_THEX                   (0x1   << 2  )
#define ADC0STA_THEX_DIS               (0x0   << 2  ) /* DIS                      */
#define ADC0STA_THEX_EN                (0x1   << 2  ) /* EN                       */

/* ADC0STA[OVR] - ADC overrange bit. */
#define ADC0STA_OVR_BBA                (*(volatile unsigned long *) 0x42600004)
#define ADC0STA_OVR_MSK                (0x1   << 1  )
#define ADC0STA_OVR                    (0x1   << 1  )
#define ADC0STA_OVR_DIS                (0x0   << 1  ) /* DIS                      */
#define ADC0STA_OVR_EN                 (0x1   << 1  ) /* EN                       */

/* ADC0STA[RDY] - valid conversion result */
#define ADC0STA_RDY_BBA                (*(volatile unsigned long *) 0x42600000)
#define ADC0STA_RDY_MSK                (0x1   << 0  )
#define ADC0STA_RDY                    (0x1   << 0  )
#define ADC0STA_RDY_DIS                (0x0   << 0  ) /* DIS                      */
#define ADC0STA_RDY_EN                 (0x1   << 0  ) /* EN                       */

