ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ADI/ADUCM36x/ADuCM360.h
/* ADCCFG[GNDSWRESEN] - 20k resistor in series with GND_SW */
#define ADCCFG_GNDSWRESEN_BBA          (*(volatile unsigned long *) 0x42600398)
#define ADCCFG_GNDSWRESEN_MSK          (0x1   << 6  )
#define ADCCFG_GNDSWRESEN              (0x1   << 6  )
#define ADCCFG_GNDSWRESEN_DIS          (0x0   << 6  ) /* DIS                      */
#define ADCCFG_GNDSWRESEN_EN           (0x1   << 6  ) /* EN                       */

/* ADCCFG[EXTBUF] - Control signals for ext_ref buffers bits */
#define ADCCFG_EXTBUF_MSK              (0x3   << 0  )
#define ADCCFG_EXTBUF_OFF              (0x0   << 0  ) /* OFF                      */
#define ADCCFG_EXTBUF_VREFPN           (0x1   << 0  ) /* VREFPN                   */
#define ADCCFG_EXTBUF_VREFP_VREF2P     (0x2   << 0  ) /* VREFP_VREF2P             */

/* Reset Value for ADC0FLT*/
#define ADC0FLT_RVAL                   0x7D 

/* ADC0FLT[CHOP] - Enables System-Chopping bits */
#define ADC0FLT_CHOP_BBA               (*(volatile unsigned long *) 0x4260043C)
#define ADC0FLT_CHOP_MSK               (0x1   << 15 )
#define ADC0FLT_CHOP                   (0x1   << 15 )
#define ADC0FLT_CHOP_OFF               (0x0   << 15 ) /* OFF                      */
#define ADC0FLT_CHOP_ON                (0x1   << 15 ) /* ON                       */

/* ADC0FLT[RAVG2] - Enables a running Average-By-2 bits */
#define ADC0FLT_RAVG2_BBA              (*(volatile unsigned long *) 0x42600438)
#define ADC0FLT_RAVG2_MSK              (0x1   << 14 )
#define ADC0FLT_RAVG2                  (0x1   << 14 )
#define ADC0FLT_RAVG2_OFF              (0x0   << 14 ) /* OFF                      */
#define ADC0FLT_RAVG2_ON               (0x1   << 14 ) /* ON                       */

/* ADC0FLT[SINC4EN] - Enable the Sinc4 filter instead of Sinc3 filter. */
#define ADC0FLT_SINC4EN_BBA            (*(volatile unsigned long *) 0x42600430)
#define ADC0FLT_SINC4EN_MSK            (0x1   << 12 )
#define ADC0FLT_SINC4EN                (0x1   << 12 )
#define ADC0FLT_SINC4EN_DIS            (0x0   << 12 ) /* DIS                      */
#define ADC0FLT_SINC4EN_EN             (0x1   << 12 ) /* EN                       */

/* ADC0FLT[AF] - Averaging filter */
#define ADC0FLT_AF_MSK                 (0xF   << 8  )

/* ADC0FLT[NOTCH2] - Inserts a notch at FNOTCH2 */
#define ADC0FLT_NOTCH2_BBA             (*(volatile unsigned long *) 0x4260041C)
#define ADC0FLT_NOTCH2_MSK             (0x1   << 7  )
#define ADC0FLT_NOTCH2                 (0x1   << 7  )
#define ADC0FLT_NOTCH2_DIS             (0x0   << 7  ) /* DIS                      */
#define ADC0FLT_NOTCH2_EN              (0x1   << 7  ) /* EN                       */

/* ADC0FLT[SF] - SINC Filter value */
#define ADC0FLT_SF_MSK                 (0x7F  << 0  )

/* Reset Value for ADC0MDE*/
#define ADC0MDE_RVAL                   0x0 

/* ADC0MDE[PGA] - PGA Gain Select bit */
#define ADC0MDE_PGA_MSK                (0xF   << 4  )
#define ADC0MDE_PGA_G1                 (0x0   << 4  ) /* G1                       */
#define ADC0MDE_PGA_G2                 (0x1   << 4  ) /* G2                       */
#define ADC0MDE_PGA_G4                 (0x2   << 4  ) /* G4                       */
#define ADC0MDE_PGA_G8                 (0x3   << 4  ) /* G8                       */
#define ADC0MDE_PGA_G16                (0x4   << 4  ) /* G16                      */
#define ADC0MDE_PGA_G32                (0x5   << 4  ) /* G32                      */
#define ADC0MDE_PGA_G64                (0x6   << 4  ) /* G64                      */
#define ADC0MDE_PGA_G128               (0x7   << 4  ) /* G128                     */

/* ADC0MDE[ADCMOD2] - ADC modulator gain of 2 control bits */
#define ADC0MDE_ADCMOD2_BBA            (*(volatile unsigned long *) 0x4260048C)
#define ADC0MDE_ADCMOD2_MSK            (0x1   << 3  )
#define ADC0MDE_ADCMOD2                (0x1   << 3  )
#define ADC0MDE_ADCMOD2_MOD2OFF        (0x0   << 3  ) /* MOD2OFF                  */
#define ADC0MDE_ADCMOD2_MOD2ON         (0x1   << 3  ) /* MOD2ON                   */

/* ADC0MDE[ADCMD] - ADC Mode bits */
#define ADC0MDE_ADCMD_MSK              (0x7   << 0  )
#define ADC0MDE_ADCMD_OFF              (0x0   << 0  ) /* OFF                      */
#define ADC0MDE_ADCMD_CONT             (0x1   << 0  ) /* CONT                     */
#define ADC0MDE_ADCMD_SINGLE           (0x2   << 0  ) /* SINGLE                   */
#define ADC0MDE_ADCMD_IDLE             (0x3   << 0  ) /* IDLE                     */
#define ADC0MDE_ADCMD_INTOCAL          (0x4   << 0  ) /* INTOCAL                  */
#define ADC0MDE_ADCMD_INTGCAL          (0x5   << 0  ) /* INTGCAL                  */
#define ADC0MDE_ADCMD_SYSOCAL          (0x6   << 0  ) /* SYSOCAL                  */
#define ADC0MDE_ADCMD_SYSGCAL          (0x7   << 0  ) /* SYSGCAL                  */

/* Reset Value for ADC0RCR*/
#define ADC0RCR_RVAL                   0x1 

/* ADC0RCR[VALUE] -  */
#define ADC0RCR_VALUE_MSK              (0xFFFF << 0  )

/* Reset Value for ADC0RCV*/
#define ADC0RCV_RVAL                   0x0 

/* ADC0RCV[VALUE] -  */
#define ADC0RCV_VALUE_MSK              (0xFFFF << 0  )

/* Reset Value for ADC0TH*/
#define ADC0TH_RVAL                    0x0 

/* ADC0TH[VALUE] -  */
#define ADC0TH_VALUE_MSK               (0xFFFF << 0  )

/* Reset Value for ADC0THC*/
#define ADC0THC_RVAL                   0x1 

/* ADC0THC[VALUE] -  */
#define ADC0THC_VALUE_MSK              (0xFF  << 0  )

/* Reset Value for ADC0THV*/
#define ADC0THV_RVAL                   0x0 

/* ADC0THV[VALUE] -  */
#define ADC0THV_VALUE_MSK              (0xFF  << 0  )

/* Reset Value for ADC0ACC*/
#define ADC0ACC_RVAL                   0x0 

/* ADC0ACC[VALUE] -  */
#define ADC0ACC_VALUE_MSK              (0xFFFFFFFF << 0  )

/* Reset Value for ADC0ATH*/
#define ADC0ATH_RVAL                   0x0 

/* ADC0ATH[VALUE] -  */
#define ADC0ATH_VALUE_MSK              (0xFFFFFFFF << 0  )

/* Reset Value for ADC0PRO*/
#define ADC0PRO_RVAL                   0x0 

